import React from 'react';

const MantraStrip = () => {
  const mantra = "या देवी सर्वभूतेषु विष्णुमायेति शब्दिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु चेतनेत्यभि धीयते।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु बुद्धिरूपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु निद्रारूपेणसंस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु क्षुधारूपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु छायारुपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु शक्तिरूपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु तृष्णारूपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषू क्षान्तिरूपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषू जातिरूपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषू लज्जारुपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु शांतिरूपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु श्रद्धारूपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषू कान्तिरूपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु लक्ष्मीरूपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु वृत्तिरुपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु स्मृतीरुपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥या देवी सर्वभूतेषु दयारूपेण संस्थिता।नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥";

  return (
    <section className="mantra-strip">
      <div className="mantra-container">
        <div className="mantra-wrapper">
          <div className="mantra-text">{mantra}</div>
          <div className="mantra-text">{mantra}</div>
        </div>
      </div>
    </section>
  );
};

export default MantraStrip;

